{
  "header": {
    "badge": "RESUMEN EJECUTIVO DE INTELIGENCIA",
    "dateline": "Febrero 2026  |  Plataforma de Inteligencia RUBLI",
    "title": "9.6 Billones de Pesos Bajo el Microscopio",
    "subtitle": "Un Análisis Integral de la Contratación Pública Federal de México, 2002-2025",
    "lead": "Entre 2002 y 2025, el gobierno federal mexicano adjudicó {{totalContracts}} contratos de contratación pública por un valor combinado de {{totalValue}} — aproximadamente {{totalValueUSD}}. Este informe presenta los hallazgos de un análisis sistemático impulsado por inteligencia artificial de cada uno de esos contratos. Utilizando un modelo calibrado por sector con 16 variables, validado contra quince casos documentados de corrupción, identificamos patrones consistentes con fraude, colusión y abuso en contratos por un valor estimado de {{valueAtRisk}} — {{pct}}% del valor total de contratación. Estos hallazgos no constituyen prueba de irregularidades. Son señales estadísticas que ameritan investigación.",
    "contracts": "Contratos",
    "totalValue": "Valor Total",
    "vendors": "Proveedores",
    "institutions": "Instituciones"
  },

  "keyFindings": {
    "title": "Hallazgos Clave",
    "items": [
      "El 71% de los contratos federales omiten la licitación abierta — una característica estructural, no una excepción",
      "Cada diciembre durante 23 años, el gasto aumenta 1.33× — vaciado presupuestal repetido en cada administración",
      "El 7.9% del valor total de contratación está clasificado como riesgo alto o crítico, concentrado en pocos proveedores dominantes",
      "Nuestro modelo de IA validado con 96% de precisión habría detectado el fraude del IMSS 8 años antes del escándalo"
    ]
  },

  "predictors": {
    "price_volatility": "Volatilidad de Precios",
    "institution_diversity": "Diversidad Institucional",
    "win_rate": "Tasa de Adjudicación",
    "vendor_concentration": "Concentración de Proveedores",
    "sector_spread": "Dispersión Sectorial",
    "industry_mismatch": "Incompatibilidad Industrial",
    "same_day_count": "Contratos Mismo Día",
    "direct_award": "Adjudicación Directa",
    "ad_period_days": "Período de Publicación",
    "institution_risk": "Riesgo Institucional",
    "single_bid": "Licitante Único",
    "network_member_count": "Membresía en Red",
    "year_end": "Fin de Año Fiscal",
    "price_ratio": "Ratio de Precios",
    "price_hyp_confidence": "Hipótesis de Precios",
    "co_bid_rate": "Tasa de Co-licitación"
  },

  "sPatterns": {
    "title": "Tres Patrones Sistémicos",
    "intro": "Antes de preguntar qué contratos son sospechosos, los datos revelan algo más fundamental: tres patrones estructurales que permean la contratación pública federal mexicana en todas las administraciones, sectores y décadas. No son anomalías — son el sistema.",
    "p1DirectAward": {
      "label": "Patrón 01",
      "name": "La Economía de Adjudicación Directa",
      "desc": "El {{pct}}% de todos los contratos federales se adjudica sin licitación abierta — ya sea como adjudicaciones directas o licitaciones restringidas. Los marcos convencionales anticorrupción tratan las adjudicaciones directas como señales de alerta. Los datos mexicanos revelan algo más preocupante: <bold>la competencia misma está en gran medida ausente</bold>. No hay licitación que manipular cuando solo hay un postor.",
      "note": "Esta no es una anomalía reciente. La tasa no competitiva se ha mantenido por encima del 65% en las cinco administraciones desde 2002."
    },
    "p2December": {
      "label": "Patrón 02",
      "name": "La Carrera de Diciembre",
      "desc": "Cada diciembre, las adjudicaciones de contratos aumentan 1.33× por encima del promedio mensual — un patrón que se ha repetido sin interrupción durante 23 años y cinco administraciones. Es impulsado por la lógica presupuestal de 'úsalo o piérdelo' del año fiscal: las dependencias se apresuran a comprometer fondos no gastados antes del 31 de diciembre. La contratación apresurada es contratación comprometida.",
      "note": "En años con datos suficientes, el incremento fue estadísticamente significativo en 3 de 10 años medidos. El patrón es estructural; su impacto en la corrupción se agrava por la presión de plazos."
    },
    "p3Concentration": {
      "label": "Patrón 03",
      "name": "La Paradoja de la Concentración de Valor",
      "desc": "El 7.9% del valor total de contratación se encuentra en contratos clasificados como riesgo alto o crítico — y ese riesgo se concentra en un número muy reducido de proveedores dominantes. Los proveedores que capturan más valor son también los más estadísticamente anómalos. La concentración no es solo un síntoma de la corrupción; es su predictor estadístico más fuerte.",
      "note": "La volatilidad de precios — proveedores con montos de contratos que varían enormemente — es la señal #1 de corrupción. La corrupción está en quién sigue ganando, no en qué tipo de procedimiento se usó."
    }
  },

  "s1": {
    "title": "La Amenaza",
    "p1": "De los {{totalValue}} en contratación pública analizada, un estimado de <bold>{{valueAtRisk}}</bold> — {{pct}}% del valor total — se encuentra en contratos clasificados como de riesgo alto o crítico. Para contextualizar, el presupuesto federal anual de educación de México es de aproximadamente 400 mil millones de pesos. El valor en riesgo en este conjunto de datos equivale aproximadamente a {{years}} años de gasto educativo.",
    "p2": "El riesgo no se distribuye uniformemente. La mayor parte del valor señalado se concentra en un número reducido de contratos de alto valor otorgados a proveedores dominantes en salud, infraestructura y energía. El {{remainingPct}}% restante del valor se ubica en categorías de riesgo medio o bajo — no exento de problemas, pero menos urgentemente sospechoso.",
    "riskDistLabel": "DISTRIBUCIÓN DE RIESGO POR VALOR",
    "riskLevel": {
      "critical": "Crítico",
      "high": "Alto",
      "medium": "Medio",
      "low": "Bajo"
    },
    "criticalContracts": "Contratos críticos",
    "highRiskContracts": "Contratos de alto riesgo",
    "directAwards": "Adjudicaciones directas",
    "singleBidders": "Licitantes únicos",
    "p3": "Un hallazgo contraintuitivo: <bold>las adjudicaciones directas no son la principal señal de riesgo</bold>. En nuestro modelo, los procedimientos de adjudicación directa tienen solo un coeficiente ligeramente positivo (+0.182), proporcionando mínima capacidad discriminatoria. La verdadera señal de alerta no es cómo se adjudica un contrato, sino <bold>quién sigue ganando</bold>. La volatilidad de precios — proveedores con montos de contratos que varían drásticamente — es el predictor individual más fuerte de corrupción en v5.0."
  },

  "s2": {
    "title": "La Prueba",
    "p1": "Cualquier modelo puede señalar contratos. La pregunta es si señala los correctos. Validamos nuestro modelo contra {{cases}} casos documentados de corrupción mexicana que abarcan {{contracts}} contratos de {{vendors}} proveedores identificados. No son hipotéticos — son casos que llevaron a investigaciones penales, arrestos y escándalos públicos. Se le preguntó al modelo: ¿los habrías señalado?",
    "p2": "La respuesta: <bold>sí, en el {{detectionRate}}% de los casos</bold> (a nivel de riesgo medio o superior). El modelo alcanza un AUC-ROC de {{auc}}, lo que significa que clasifica correctamente un contrato corrupto por encima de uno limpio el {{aucPct}}% de las veces.",
    "detectionLabel": "TASA DE DETECCIÓN ALTO+ POR CASO",
    "nContracts": "{{count}} contratos",
    "earlyWarning": "<accent>Valor de alerta temprana:</accent> El modelo habría activado alarmas sobre los contratos de empresas fantasma del IMSS desde 2008 — <italic>ocho años</italic> antes de que el escándalo se hiciera público en 2016. Para Segalmex, los primeros contratos señalados preceden la investigación de 2020 por varios años.",
    "p3": "Las detecciones más fuertes ocurren en casos que involucran <bold>proveedores concentrados en salud y agricultura</bold> — IMSS (99.0%), Segalmex (94.3%), contratación COVID-19 (91.8%). Estos casos comparten un patrón común: un número reducido de proveedores capturando una cuota de mercado desproporcionada. La detección es más débil en casos de <bold>soborno y conflicto de interés</bold> — Grupo Higa (33.3%), Cyber Robotic (43.2%) — donde la corrupción opera a través de relaciones más que de patrones estadísticos en los datos de contratación."
  },

  "s3": {
    "title": "Dónde se Concentra el Riesgo",
    "p1": "Tres sectores dominan el panorama de riesgo. <bold>Salud</bold> concentra el mayor volumen — {{healthContracts}} contratos por un valor de {{healthValue}}. <bold>Infraestructura</bold> tiene menos contratos pero valores unitarios enormes. <bold>Energía</bold> combina volumen y valor en un sector con concentración estructural (pocos proveedores pueden atender a Pemex y CFE).",
    "riskLabel": "VALOR ESTIMADO EN RIESGO POR SECTOR",
    "health": {
      "name": "Salud",
      "text": "El sector con mayor volumen de contratos. Sede de la red de empresas fantasma del IMSS y el fraude en contrataciones COVID-19 — dos de los tres casos de corrupción más grandes del conjunto de datos. La magnitud implica que incluso una tasa de riesgo modesta se traduce en un enorme valor absoluto en riesgo."
    },
    "infrastructure": {
      "name": "Infraestructura",
      "text": "Tasa de riesgo relativamente baja, pero dominada por megacontratos de empresas como CICSA e ICA. Un solo contrato de infraestructura señalado puede valer más que miles de contratos señalados de menor tamaño en otros sectores combinados."
    },
    "agriculture": {
      "name": "Agricultura",
      "text": "Solo el 3.2% del valor total de contratación, pero desproporcionadamente representado en contratos de alto riesgo. El escándalo de Segalmex (LICONSA, DICONSA) expuso fraude sistemático en distribución de alimentos — un sector donde la supervisión históricamente fue débil."
    }
  },

  "s4": {
    "title": "Quiénes Están Involucrados",
    "p1": "Los 10 principales proveedores por valor de contratos concentran colectivamente <bold>{{totalValue}}</bold> en contratación pública. Entre ellos, dos son participantes confirmados en casos documentados de corrupción. Varios otros tienen puntuaciones de riesgo superiores a 0.20, indicando patrones estadísticos consistentes con los casos de corrupción de nuestros datos de entrenamiento.",
    "table": {
      "rank": "Pos.",
      "vendor": "Proveedor",
      "value": "Valor",
      "contracts": "Contratos",
      "avgRisk": "Riesgo Prom."
    },
    "p2": "Es importante distinguir <bold>alto valor de alto riesgo</bold>. CICSA (Operadora CICSA) ocupa el puesto #1 por valor total de contratos con {{topValue}}B MXN, pero tiene una puntuación de riesgo moderada. Por el contrario, proveedores con menos contratos pero de mayor riesgo pueden representar objetivos de investigación más accionables. El ícono <shield></shield> marca proveedores confirmados en casos documentados de corrupción."
  },

  "s5": {
    "title": "La Red",
    "p1": "La corrupción rara vez opera en aislamiento. Nuestro análisis de co-licitación identificó <bold>8,701 proveedores</bold> con patrones de licitación sospechosos — proveedores que aparecen frecuentemente en los mismos procedimientos de contratación pero rara vez compiten entre sí. Estos patrones afectaron más de <bold>1 millón de contratos</bold>.",
    "p2": "Emergen dos patrones clave: la <bold>oferta de cobertura</bold>, donde socios consistentemente presentan ofertas perdedoras para crear la apariencia de competencia, y la <bold>rotación de ofertas</bold>, donde proveedores se turnan para ganar en patrones predecibles. Ambos son indicadores clásicos de cárteles de licitación documentados por la OCDE.",
    "suspiciousVendors": "Proveedores sospechosos",
    "affectedContracts": "Contratos afectados",
    "coBidThreshold": "Umbral de co-licitación",
    "p3": "La concentración institucional también juega un papel crítico. Cuando un solo proveedor captura una proporción desproporcionada del presupuesto de contratación de una institución, crea dependencia y reduce la presión competitiva — condiciones propicias para la corrupción. Nuestro análisis mide esto a través del Índice Herfindahl-Hirschman (IHH) a nivel institucional."
  },

  "s6": {
    "title": "Los Datos",
    "p1": "Este análisis se construye sobre COMPRANET, el portal de transparencia en contrataciones públicas federales de México. Los datos abarcan cuatro estructuras distintas con niveles de calidad dramáticamente diferentes — un desafío que influye en todo, desde la confiabilidad de las puntuaciones de riesgo hasta la capacidad de análisis de redes.",
    "structures": {
      "a": { "quality": "Más Baja", "note": "Las puntuaciones de riesgo pueden estar subestimadas. Análisis de redes prácticamente imposible." },
      "b": { "quality": "Mejor", "note": "Texto en MAYÚSCULAS. 72.2% tasa de adjudicación directa. Identificación de proveedores mejorando." },
      "c": { "quality": "Buena", "note": "Texto mixto. 78.4% tasa de adjudicación directa. Confiable para la mayoría de análisis." },
      "d": { "quality": "Óptima", "note": "100% códigos de partida. Datos más ricos disponibles." }
    },
    "rfc": "RFC",
    "trillionLesson": "<accent>La lección del billón de pesos:</accent> Un análisis previo de estos datos incluyó 7 contratos con valores superiores a 1 billón de pesos — errores obvios de punto decimal que destruyeron todas las analíticas. Estos contratos, de ser reales, habrían representado el 12.5% del presupuesto federal completo de México cada uno. Ahora rechazamos cualquier contrato que exceda 100 mil millones de MXN y señalamos contratos superiores a 10 mil millones para revisión manual.",
    "p2": "La validación de montos es crítica: el presupuesto federal completo de México es de aproximadamente 8 billones de MXN anuales. Los contratos legítimos más grandes de PEMEX típicamente oscilan entre 1 y 5 mil millones de MXN. Nuestras reglas de validación aseguran que los errores de datos no corrompan silenciosamente las analíticas."
  },

  "s7": {
    "title": "A Través de las Administraciones",
    "p1": "El riesgo de corrupción ha demostrado ser notablemente persistente a través de las transiciones políticas. Ninguna administración ha sido inmune, aunque el <italic>carácter</italic> del riesgo varía — desde limitaciones de calidad de datos en la era Fox, hasta concentración de volumen bajo Peña Nieto, hasta las tasas más altas de adjudicación directa bajo AMLO.",
    "labels": {
      "contracts": "Contratos",
      "value": "Valor",
      "highRisk": "Alto Riesgo",
      "directAward": "Adj. Directa"
    },
    "narratives": {
      "Fox": "Período de datos más temprano (Estructura A) con la menor calidad — 0.1% de cobertura RFC. Las puntuaciones de riesgo pueden estar subestimadas. Datos de adjudicación directa no disponibles para este período.",
      "Calderon": "El volumen de contratos se duplicó con la modernización de COMPRANET. La red de empresas fantasma del IMSS comenzó operaciones durante este período, con los primeros contratos fechados en 2008.",
      "Pena Nieto": "Mayor volumen de contratación de cualquier administración. 73.4% adjudicaciones directas. Período del escándalo de sobornos de Odebrecht, La Estafa Maestra y el caso de conflicto de interés de Grupo Higa.",
      "AMLO": "Mayor tasa de riesgo observada y mayor porcentaje de adjudicación directa con 79.5%. Los escándalos de Segalmex y contrataciones COVID-19 ocurrieron durante esta administración.",
      "Sheinbaum": "Solo datos iniciales (2025). Ligera disminución tanto en tasa de riesgo como en porcentaje de adjudicación directa respecto al predecesor. Demasiado temprano para una evaluación concluyente."
    }
  },

  "s8": {
    "title": "Cómo lo Sabemos",
    "p1": "El modelo v5.0 transforma el análisis de contratación de una lista de verificación de indicadores ponderados a un <bold>marco de probabilidades calibradas</bold>. Cada contrato recibe una puntuación que representa la probabilidad estimada de corrupción, derivada de 16 variables normalizadas contra líneas base sectoriales y anuales usando z-scores, con detección de anomalías multivariada vía distancia de Mahalanobis y regresión logística bayesiana entrenada con {{contracts}} contratos confirmados como irregulares.",
    "discriminationPower": "Poder discriminatorio",
    "calibrationQuality": "Calidad de calibración",
    "vsRandom": "vs línea base aleatoria",
    "coeffLabel": "COEFICIENTES DEL MODELO (PRINCIPALES PREDICTORES)",
    "reducesRisk": "← Reduce riesgo",
    "increasesRisk": "Aumenta riesgo →",
    "p2": "<bold>La volatilidad de precios es el predictor individual más fuerte</bold> — proveedores cuyos montos de contratos varían drásticamente en su portafolio son los más sospechosos. Esto desafía el kit de herramientas anticorrupción estándar. La diversidad institucional y la tasa de adjudicación completan los tres principales, mientras que indicadores tradicionales como licitación única y co-licitación proporcionan poca señal discriminatoria."
  },

  "s9": {
    "title": "Lo Que No Podemos Ver",
    "p1": "La honestidad intelectual exige declarar lo que este análisis no puede hacer. Un modelo de riesgo es una lente, no un oráculo. Amplifica patrones de datos históricos, lo que significa que es ciego a cualquier cosa que no se parezca al pasado.",
    "limitations": {
      "groundTruth": {
        "title": "Concentración de Verdad Base",
        "text": "Aunque la verdad de campo se ha diversificado a 15 casos en los 12 sectores, los tres casos más grandes (IMSS, Segalmex, COVID) aún contribuyen la mayoría de contratos de entrenamiento. El modelo sobresale detectando fraude basado en concentración, pero puede subdetectar esquemas de corrupción novedosos.",
        "mitigation": "Agregando 8+ casos en v6.0. Solución temporal: los modelos por sector reducen este sesgo."
      },
      "dataQuality": {
        "title": "La Calidad de Datos se Degrada con el Tiempo",
        "text": "Los datos de Estructura A (2002-2010) tienen solo 0.1% de cobertura RFC, haciendo poco confiable la identificación de proveedores. Las puntuaciones de riesgo para este período pueden estar subestimadas, y el análisis de redes es prácticamente imposible.",
        "mitigation": "Para análisis de redes, filtrar a contratos desde 2018+ (30%+ cobertura RFC)."
      },
      "correlation": {
        "title": "Correlación No Es Causalidad",
        "text": "Una puntuación de riesgo alta indica anomalía estadística consistente con patrones de corrupción conocidos — no constituye prueba de irregularidades. Algunos sectores (Defensa, Energía) tienen razones estructurales para la concentración de proveedores que no son corruptas.",
        "mitigation": "Siempre cruzar con informes de auditoría de la ASF antes de publicar."
      },
      "unknowns": {
        "title": "Incógnitas Desconocidas",
        "text": "Los esquemas de corrupción novedosos que no se parezcan a los 15 casos documentados no serán señalados por este modelo. El modelo detecta lo que fue entrenado a reconocer — patrones del pasado, no innovación en el fraude.",
        "mitigation": "La integración de datos de auditoría de la ASF está en la hoja de ruta de v6.0."
      }
    },
    "calibrationNote": "Esta tasa refleja umbrales calibrados con la referencia internacional de la OCDE (2–15%). Con umbrales alternativos, la tasa varía del 2% al 23%. Estas son señales estadísticas para priorización — no estimaciones de la prevalencia real de corrupción."
  },

  "s10": {
    "title": "Lo Que Viene",
    "p1": "Este análisis no es un punto final — es un punto de partida para la investigación. El modelo ha identificado dónde buscar. Los siguientes pasos maximizarían el impacto de la plataforma en la integridad de las contrataciones.",
    "actions": {
      "investigate": {
        "title": "Investigar Proveedores de Alta Concentración",
        "description": "Los proveedores con puntuaciones de riesgo crítico concentran colectivamente más de 1 billón de MXN en contratación. Comenzar con los 50 principales por valor ponderado por riesgo.",
        "link": "Abrir Investigación"
      },
      "safeguards": {
        "title": "Fortalecer Salvaguardas Competitivas",
        "description": "El problema no es qué tipo de procedimiento se usa, sino quién participa y gana. Enfocar la supervisión en la concentración de proveedores más que en la clasificación de procedimientos.",
        "link": "Ver Patrones"
      },
      "diversify": {
        "title": "Diversificar Verdad Base",
        "description": "El modelo necesita más casos de entrenamiento de los sectores de infraestructura, defensa y tecnología. Los informes de auditoría de la ASF e investigaciones de Mexicanos Contra la Corrupción son fuentes prometedoras.",
        "link": "Verdad Base"
      }
    }
  },

  "footer": {
    "platform": "Plataforma de Inteligencia RUBLI",
    "compranet": "COMPRANET 2002-2025",
    "sectors": "12 sectores",
    "quote": "\"Hay cosas que no pueden medirse en términos de victoria o derrota.\"",
    "copyright": "© {{year}} Proyecto RUBLI. Todos los Derechos Reservados.",
    "disclaimer": "Las puntuaciones de riesgo son probabilidades calibradas con intervalos de confianza. Una puntuación alta indica anomalía estadística consistente con patrones de corrupción — no constituye prueba de irregularidades."
  }
}
