{
  "riskScore": {
    "title": "Puntuación de Riesgo",
    "description": "Una probabilidad calibrada (0-1) que estima la posibilidad de que un contrato involucre patrones de corrupción. Basada en 16 características estadísticas comparadas contra casos documentados de corrupción. Mayor = más sospechoso."
  },
  "riskLevel": {
    "title": "Nivel de Riesgo",
    "description": "Categorización basada en la puntuación: Crítico (>=50%), Alto (>=30%), Medio (>=10%), Bajo (<10%). Estos umbrales están alineados con las referencias de contratación de la OCDE."
  },
  "singleBid": {
    "title": "Licitante Único",
    "description": "Un procedimiento competitivo (no adjudicación directa) donde solo un proveedor presentó oferta. Es una señal de alerta porque los procesos competitivos deberían atraer múltiples licitantes. Si solo aparece uno, puede indicar manipulación de licitaciones."
  },
  "directAward": {
    "title": "Adjudicación Directa",
    "description": "Un contrato otorgado directamente a un proveedor sin licitación competitiva. Legal en México bajo ciertas condiciones (emergencias, proveedor único). Tener un solo oferente en adjudicación directa es esperado — NO es lo mismo que licitante único."
  },
  "vendorConcentration": {
    "title": "Concentración de Proveedores",
    "description": "Qué proporción del valor total de contrataciones de un sector va a un solo proveedor. Alta concentración significa que un proveedor domina — un predictor principal de riesgo de corrupción en nuestro modelo (coeficiente +0.43)."
  },
  "mahalanobisDistance": {
    "title": "Distancia de Mahalanobis",
    "description": "Una medida estadística de qué tan inusual es un contrato en TODAS las 16 dimensiones de riesgo simultáneamente. Como preguntar: '¿Qué tan lejos está este contrato de lo normal?' Valores más altos = más anómalo."
  },
  "zScore": {
    "title": "Puntuación Z",
    "description": "Una medida estandarizada que muestra cuántas desviaciones estándar un valor está del promedio del sector/año. Una puntuación z de +2 significa que el valor es inusualmente alto comparado con contratos similares."
  },
  "hhi": {
    "title": "IHH (Índice Herfindahl-Hirschman)",
    "description": "Medida de concentración de mercado (0-10,000). Menos de 1,500 = mercado competitivo. 1,500-2,500 = moderadamente concentrado. Más de 2,500 = altamente concentrado. Usado para detectar monopolios de proveedores."
  },
  "puLearning": {
    "title": "Aprendizaje PU",
    "description": "Aprendizaje Positivo-No etiquetado: técnica para entrenar modelos cuando solo conocemos algunos contratos corruptos (positivos) pero el resto es desconocido (no etiquetado, no necesariamente limpio). Nuestro modelo usa la corrección de Elkan & Noto (2008)."
  },
  "aucRoc": {
    "title": "AUC-ROC",
    "description": "Área Bajo la Curva ROC — mide qué tan bien el modelo distingue contratos corruptos de limpios. 0.5 = adivinanza aleatoria, 1.0 = perfecto. Nuestro modelo v5.0 alcanza 0.960 (AUC de prueba)."
  },
  "industryMismatch": {
    "title": "Discrepancia de Industria",
    "description": "Cuando un proveedor gana contratos en un sector que no coincide con su negocio principal. Por ejemplo, una constructora ganando contratos de salud. Sugiere empresa fantasma o favoritismo."
  },
  "priceAnomaly": {
    "title": "Anomalía de Precio",
    "description": "Monto de contrato estadísticamente inusual comparado con contratos similares del mismo sector y año. Detectado usando el método IQR de Tukey — valores más allá de 1.5x el rango intercuartil son señalados."
  },
  "cobidding": {
    "title": "Patrón de Co-licitación",
    "description": "Cuando dos o más proveedores aparecen consistentemente juntos en procedimientos de licitación. Puede indicar especialización legítima, pero altas tasas de co-licitación con victorias alternadas sugieren rotación de ofertas (una forma de colusión)."
  },
  "yearEnd": {
    "title": "Cierre de Año Fiscal",
    "description": "Contratos otorgados en diciembre, cuando las dependencias se apresuran a gastar el presupuesto restante. Este 'gasto de fin de año' crea presión para adjudicar rápidamente, reduciendo la supervisión y aumentando el riesgo de corrupción."
  },
  "thresholdSplitting": {
    "title": "Fraccionamiento de Contratos",
    "description": "Múltiples contratos otorgados al mismo proveedor el mismo día, potencialmente para mantener cada contrato debajo del umbral que requeriría licitación competitiva. Una técnica clásica de fraude en contrataciones."
  },
  "networkRisk": {
    "title": "Riesgo de Red",
    "description": "Riesgo por relaciones entre proveedores — empresas que comparten domicilio, representante legal, o consistentemente licitan juntos. La membresía en redes puede indicar redes de empresas fantasma o cárteles de licitación."
  },
  "confidenceInterval": {
    "title": "Intervalo de Confianza",
    "description": "El rango dentro del cual probablemente cae la verdadera puntuación de riesgo (95% de confianza). Una puntuación de 0.35 [0.22, 0.48] significa que estimamos 35% de probabilidad de corrupción, pero podría estar razonablemente entre 22% y 48%."
  },
  "calibratedProbability": {
    "title": "Probabilidad Calibrada",
    "description": "Una puntuación de riesgo que representa una probabilidad real estimada de corrupción, no un número arbitrario. Nuestro modelo v5.0 produce probabilidades calibradas validadas contra casos documentados de corrupción."
  },
  "perSectorModel": {
    "title": "Modelo por Sector",
    "description": "Modelos estadísticos separados entrenados para cada uno de los 12 sectores. Los patrones de corrupción difieren: Salud → concentración de proveedores, Energía → discrepancia de industria, Infraestructura → relaciones de red."
  },
  "groundTruth": {
    "title": "Verdad Base",
    "description": "Casos documentados y verificados de corrupción usados para entrenar y validar el modelo. Usamos 15 casos con 27 proveedores y 26,582 contratos en los 12 sectores, incluyendo IMSS, Segalmex, Odebrecht, y más."
  },
  "adPeriod": {
    "title": "Período de Publicación",
    "description": "Días entre la publicación de una oportunidad de contratación y la adjudicación del contrato. Períodos muy cortos (<15 días) pueden indicar que el proceso fue apresurado para favorecer a un proveedor predeterminado."
  },
  "rfc": {
    "title": "RFC (Identificación Fiscal)",
    "description": "Registro Federal de Contribuyentes — número de identificación fiscal de México para empresas e individuos. Usado para identificar proveedores de forma única. La cobertura varía: 0.1% en datos 2002-2010 a 47% en 2023-2025."
  },
  "compranet": {
    "title": "COMPRANET",
    "description": "Plataforma electrónica de contrataciones del gobierno federal de México, operativa desde 1996 y obligatoria para todas las compras por encima del umbral. Abolida por el Congreso el 10 de abril de 2025, reemplazada por ComprasMX. Antes del reemplazo formal, 1.9 millones de contratos de 2012–2023 ya habían sido eliminados del acceso público en agosto de 2024. Fuente de los 3.1M contratos en esta base de datos."
  },
  "licitacionPublica": {
    "title": "Licitación Pública",
    "description": "El procedimiento de contratación más transparente bajo la ley mexicana. Obligatorio para contratos por encima de los umbrales de valor legal. Incluye período de publicación pública (mínimo 20 días), licitantes ilimitados y publicación obligatoria en COMPRANET. En la práctica, solo el 29% de los contratos federales usa este procedimiento — el otro 71% omite la competencia abierta."
  },
  "laassp": {
    "title": "LAASSP",
    "description": "Ley de Adquisiciones, Arrendamientos y Servicios del Sector Público — ley federal de contrataciones de México, promulgada el 4 de enero de 2000. Define cuándo las dependencias deben usar licitación abierta versus adjudicación directa, establece umbrales de valor y requisitos de publicación. La ley original fue abrogada y reemplazada en abril de 2025."
  },
  "inai": {
    "title": "INAI",
    "description": "Instituto Nacional de Transparencia, Acceso a la Información y Protección de Datos Personales — organismo independiente de transparencia de México, establecido en 2002. Ciudadanos y periodistas podían apelar al INAI cuando las dependencias negaban solicitudes de información. Abolido constitucionalmente el 20 de diciembre de 2024. Reemplazado por 'Transparencia para el Pueblo', organismo bajo la rama ejecutiva, con aproximadamente el 2% del presupuesto anterior del INAI."
  },
  "comprasmx": {
    "title": "ComprasMX",
    "description": "Plataforma de reemplazo de COMPRANET, lanzada el 18 de abril de 2025. Construida con la misma arquitectura técnica que el 'Tianguis Digital', plataforma de contrataciones de la Ciudad de México durante el mandato de Sheinbaum — que no divulgó contratos durante ese período. Incluye una regla de retención de datos de 5 años que podría eventualmente eliminar registros históricos del acceso público."
  },
  "sector": {
    "title": "Sector",
    "description": "Una de las 12 categorías de gasto del gobierno federal (Salud, Educación, Energía, etc.) clasificadas a partir de los códigos de Ramo presupuestario de México. Cada sector tiene diferentes patrones de contratación y perfiles de riesgo."
  },
  "sfp": {
    "title": "SFP (Secretaría de la Función Pública)",
    "description": "Ministerio federal de rendición de cuentas de México. Mantiene el registro oficial de empresas sancionadas de la contratación federal (Proveedores y Contratistas Sancionados). Las empresas en esta lista tienen prohibido ganar contratos del gobierno durante el período de sanción."
  },
  "rupc": {
    "title": "RUPC (Registro Único de Proveedores y Contratistas)",
    "description": "Registro unificado de empresas habilitadas para la contratación federal de México. Las empresas reciben calificaciones de cumplimiento basadas en su historial de desempeño. Estaba alojado en CompraNet (abolido en abril de 2025); continuidad bajo ComprasMX incierta."
  },
  "risk_factors": {
    "vendor_concentration": {
      "label": "Concentración de Proveedor",
      "coefficient": "+0.428",
      "validation_strength": "Fuerte (múltiples países)",
      "key_citation": "Fazekas & Tóth (2016), Political Research Quarterly",
      "mexico_note": "El predictor más fuerte de RUBLI. Refleja los patrones de corrupción basados en concentración: IMSS Empresas Fantasma, Segalmex y COVID-19."
    },
    "price_volatility": {
      "label": "Volatilidad de Precio",
      "coefficient": "+1.219",
      "validation_strength": "Fuerte (predictor principal v5.0)",
      "key_citation": "Porter & Zona (1993): La manipulación de precios es detectable",
      "mexico_note": "Nuevo en v5.0. Proveedores con montos de contrato muy variables respecto a la norma del sector."
    },
    "institution_diversity": {
      "label": "Diversidad Institucional",
      "coefficient": "-0.848",
      "validation_strength": "Negativo — factor protector",
      "key_citation": "Coviello & Mariniello (2014)",
      "mexico_note": "Los proveedores que atienden a muchas instituciones son menos sospechosos. Coeficiente negativo."
    },
    "win_rate": {
      "label": "Tasa de Éxito",
      "coefficient": "+0.727",
      "validation_strength": "Fuerte",
      "key_citation": "Conley & Decarolis (2016)",
      "mexico_note": "Nuevo en v5.0. Un proveedor que gana contratos muy por encima de la tasa base del sector sugiere acceso preferencial."
    },
    "single_bid": {
      "label": "Licitación con Un Solo Postor",
      "coefficient": "+0.013",
      "validation_strength": "Fuerte globalmente, débil en México",
      "key_citation": "Charron et al. (2017), Journal of Politics",
      "mexico_note": "Coeficiente bajo porque en México se usa la adjudicación directa en lugar de licitaciones con un solo postor."
    },
    "direct_award": {
      "label": "Adjudicación Directa",
      "coefficient": "+0.182",
      "validation_strength": "Moderado — dependiente del contexto",
      "key_citation": "OCDE (2016): Prevención de la Corrupción en Compras Públicas",
      "mexico_note": "México emite ~70% de contratos por adjudicación directa. La puntuación z normaliza esta base."
    },
    "industry_mismatch": {
      "label": "Discrepancia de Industria",
      "coefficient": "+0.305",
      "validation_strength": "Moderado",
      "key_citation": "Fazekas & Kocsis (2020)",
      "mexico_note": "La industria principal del proveedor no corresponde al sector del contrato."
    },
    "same_day_count": {
      "label": "Contratos en el Mismo Día",
      "coefficient": "+0.222",
      "validation_strength": "Moderado — señal de fraccionamiento",
      "key_citation": "ISO 37001 Sistemas Antisoborno",
      "mexico_note": "Múltiples contratos adjudicados al mismo proveedor el mismo día, sugiriendo fraccionamiento artificial."
    },
    "network_member_count": {
      "label": "Membresía en Red",
      "coefficient": "+0.064",
      "validation_strength": "Moderado",
      "key_citation": "Fazekas, Skuhrovec & Wachs (2020)",
      "mexico_note": "El proveedor pertenece a un grupo de entidades relacionadas. Corregido a positivo en v5.0."
    },
    "year_end": {
      "label": "Contrato de Fin de Año",
      "coefficient": "+0.059",
      "validation_strength": "Débil — IC cruza cero",
      "key_citation": "IMCO (México): Presupuesto de diciembre",
      "mexico_note": "Contrato adjudicado en diciembre, consistente con el comportamiento de gasto de presupuesto residual."
    },
    "institution_risk": {
      "label": "Riesgo Institucional",
      "coefficient": "+0.057",
      "validation_strength": "Débil",
      "key_citation": "Metodología CRI del FMI",
      "mexico_note": "Algunos tipos de instituciones tienen históricamente tasas de irregularidades más altas."
    },
    "ad_period_days": {
      "label": "Período de Publicación",
      "coefficient": "-0.104",
      "validation_strength": "Negativo en México",
      "key_citation": "Directiva UE 2014/24",
      "mexico_note": "Signo negativo: los proveedores corruptos conocidos tienden a operar mediante procedimientos de duración normal, no apresurados."
    },
    "sector_spread": {
      "label": "Distribución Sectorial",
      "coefficient": "-0.374",
      "validation_strength": "Negativo — factor protector",
      "key_citation": "Fazekas & Kocsis (2020)",
      "mexico_note": "Nuevo en v5.0. Los proveedores que operan en muchos sectores son menos sospechosos."
    },
    "price_ratio": {
      "label": "Ratio de Precio",
      "coefficient": "-0.015",
      "validation_strength": "Casi nulo",
      "key_citation": "Banco Mundial INT (2019)",
      "mexico_note": "Monto del contrato vs. mediana sectorial. Casi nulo porque price_volatility absorbe mejor la señal de precio."
    },
    "co_bid_rate": {
      "label": "Tasa de Co-Licitación",
      "coefficient": "0.000",
      "validation_strength": "Sin señal en datos de entrenamiento",
      "key_citation": "Porter & Zona (1993)",
      "mexico_note": "Regularizado a cero. Los patrones de co-licitación no discriminan en los datos de entrenamiento de México."
    },
    "price_hyp_confidence": {
      "label": "Confianza Hipótesis de Precio",
      "coefficient": "+0.001",
      "validation_strength": "Casi nulo",
      "key_citation": "Método IQR de Tukey",
      "mexico_note": "Puntuación de confianza del outlier estadístico. Casi nulo — price_volatility absorbe la señal de forma más efectiva."
    }
  }
}
